Revit 2024 API
RebarContainerItem.SetLayoutAsSingle Method
 Sets the Layout Rule property of rebar set to Single.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void SetLayoutAsSingle()
Visual Basic
Public Sub SetLayoutAsSingle
Visual C++
public:
void SetLayoutAsSingle()
Remarks
 Only one bar will remain, which is at the position of rebar plane
See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace